{"keras_version": "2.0.6", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 400], "sparse": false, "name": "input_20", "dtype": "float32"}, "name": "input_20"}, {"inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_153", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 300, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "trainable": true, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 0.0}}}, "name": "dense_153"}, {"inbound_nodes": [[["dense_153", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_154", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 175, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "trainable": true, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 0.0}}}, "name": "dense_154"}, {"inbound_nodes": [[["dense_154", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_155", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 40, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "trainable": true, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 0.0}}}, "name": "dense_155"}, {"inbound_nodes": [[["dense_155", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_156", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "trainable": true, "activity_regularizer": null}, "name": "dense_156"}], "output_layers": [["dense_156", 0, 0]], "input_layers": [["input_20", 0, 0]], "name": "model_20"}, "backend": "tensorflow"}