{"class_name": "Model", "config": {"name": "model_80", "output_layers": [["dense_636", 0, 0]], "layers": [{"name": "input_80", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_80", "batch_input_shape": [null, 100], "sparse": false, "dtype": "float32"}}, {"name": "dense_633", "class_name": "Dense", "inbound_nodes": [[["input_80", 0, 0, {}]]], "config": {"name": "dense_633", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 60, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_634", "class_name": "Dense", "inbound_nodes": [[["dense_633", 0, 0, {}]]], "config": {"name": "dense_634", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 70, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_635", "class_name": "Dense", "inbound_nodes": [[["dense_634", 0, 0, {}]]], "config": {"name": "dense_635", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_636", "class_name": "Dense", "inbound_nodes": [[["dense_635", 0, 0, {}]]], "config": {"name": "dense_636", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true}}], "input_layers": [["input_80", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}