{"class_name": "Model", "config": {"name": "model_20", "output_layers": [["dense_156", 0, 0]], "layers": [{"name": "input_20", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_20", "batch_input_shape": [null, 100], "sparse": false, "dtype": "float32"}}, {"name": "dense_153", "class_name": "Dense", "inbound_nodes": [[["input_20", 0, 0, {}]]], "config": {"name": "dense_153", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 90, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_154", "class_name": "Dense", "inbound_nodes": [[["dense_153", 0, 0, {}]]], "config": {"name": "dense_154", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 40, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_155", "class_name": "Dense", "inbound_nodes": [[["dense_154", 0, 0, {}]]], "config": {"name": "dense_155", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_156", "class_name": "Dense", "inbound_nodes": [[["dense_155", 0, 0, {}]]], "config": {"name": "dense_156", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true}}], "input_layers": [["input_20", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}