{"class_name": "Model", "config": {"name": "model_99", "output_layers": [["dense_788", 0, 0]], "layers": [{"name": "input_99", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_99", "batch_input_shape": [null, 100], "sparse": false, "dtype": "float32"}}, {"name": "dense_785", "class_name": "Dense", "inbound_nodes": [[["input_99", 0, 0, {}]]], "config": {"name": "dense_785", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 60, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_786", "class_name": "Dense", "inbound_nodes": [[["dense_785", 0, 0, {}]]], "config": {"name": "dense_786", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 30, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_787", "class_name": "Dense", "inbound_nodes": [[["dense_786", 0, 0, {}]]], "config": {"name": "dense_787", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 20, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_788", "class_name": "Dense", "inbound_nodes": [[["dense_787", 0, 0, {}]]], "config": {"name": "dense_788", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true}}], "input_layers": [["input_99", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}