{"class_name": "Model", "config": {"name": "model_111", "output_layers": [["dense_884", 0, 0]], "layers": [{"name": "input_111", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_111", "batch_input_shape": [null, 100], "sparse": false, "dtype": "float32"}}, {"name": "dense_881", "class_name": "Dense", "inbound_nodes": [[["input_111", 0, 0, {}]]], "config": {"name": "dense_881", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_882", "class_name": "Dense", "inbound_nodes": [[["dense_881", 0, 0, {}]]], "config": {"name": "dense_882", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_883", "class_name": "Dense", "inbound_nodes": [[["dense_882", 0, 0, {}]]], "config": {"name": "dense_883", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_884", "class_name": "Dense", "inbound_nodes": [[["dense_883", 0, 0, {}]]], "config": {"name": "dense_884", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true}}], "input_layers": [["input_111", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}