{"class_name": "Model", "config": {"name": "model_67", "output_layers": [["dense_532", 0, 0]], "layers": [{"name": "input_67", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_67", "batch_input_shape": [null, 100], "sparse": false, "dtype": "float32"}}, {"name": "dense_529", "class_name": "Dense", "inbound_nodes": [[["input_67", 0, 0, {}]]], "config": {"name": "dense_529", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 70, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_530", "class_name": "Dense", "inbound_nodes": [[["dense_529", 0, 0, {}]]], "config": {"name": "dense_530", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 40, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_531", "class_name": "Dense", "inbound_nodes": [[["dense_530", 0, 0, {}]]], "config": {"name": "dense_531", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 40, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_532", "class_name": "Dense", "inbound_nodes": [[["dense_531", 0, 0, {}]]], "config": {"name": "dense_532", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true}}], "input_layers": [["input_67", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}