{"class_name": "Model", "config": {"name": "model_104", "output_layers": [["dense_828", 0, 0]], "layers": [{"name": "input_104", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_104", "batch_input_shape": [null, 100], "sparse": false, "dtype": "float32"}}, {"name": "dense_825", "class_name": "Dense", "inbound_nodes": [[["input_104", 0, 0, {}]]], "config": {"name": "dense_825", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_826", "class_name": "Dense", "inbound_nodes": [[["dense_825", 0, 0, {}]]], "config": {"name": "dense_826", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 70, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_827", "class_name": "Dense", "inbound_nodes": [[["dense_826", 0, 0, {}]]], "config": {"name": "dense_827", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 20, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_828", "class_name": "Dense", "inbound_nodes": [[["dense_827", 0, 0, {}]]], "config": {"name": "dense_828", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true}}], "input_layers": [["input_104", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}