{"class_name": "Model", "config": {"name": "model_36", "output_layers": [["dense_284", 0, 0]], "layers": [{"name": "input_36", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_36", "batch_input_shape": [null, 100], "sparse": false, "dtype": "float32"}}, {"name": "dense_281", "class_name": "Dense", "inbound_nodes": [[["input_36", 0, 0, {}]]], "config": {"name": "dense_281", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 80, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_282", "class_name": "Dense", "inbound_nodes": [[["dense_281", 0, 0, {}]]], "config": {"name": "dense_282", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_283", "class_name": "Dense", "inbound_nodes": [[["dense_282", 0, 0, {}]]], "config": {"name": "dense_283", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_284", "class_name": "Dense", "inbound_nodes": [[["dense_283", 0, 0, {}]]], "config": {"name": "dense_284", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true}}], "input_layers": [["input_36", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}