{"class_name": "Model", "config": {"name": "model_54", "output_layers": [["dense_428", 0, 0]], "layers": [{"name": "input_54", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_54", "batch_input_shape": [null, 100], "sparse": false, "dtype": "float32"}}, {"name": "dense_425", "class_name": "Dense", "inbound_nodes": [[["input_54", 0, 0, {}]]], "config": {"name": "dense_425", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 70, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_426", "class_name": "Dense", "inbound_nodes": [[["dense_425", 0, 0, {}]]], "config": {"name": "dense_426", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 70, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_427", "class_name": "Dense", "inbound_nodes": [[["dense_426", 0, 0, {}]]], "config": {"name": "dense_427", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 20, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_428", "class_name": "Dense", "inbound_nodes": [[["dense_427", 0, 0, {}]]], "config": {"name": "dense_428", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true}}], "input_layers": [["input_54", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}