{"class_name": "Model", "config": {"name": "model_147", "output_layers": [["dense_1172", 0, 0]], "layers": [{"name": "input_147", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_147", "batch_input_shape": [null, 100], "sparse": false, "dtype": "float32"}}, {"name": "dense_1169", "class_name": "Dense", "inbound_nodes": [[["input_147", 0, 0, {}]]], "config": {"name": "dense_1169", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 90, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_1170", "class_name": "Dense", "inbound_nodes": [[["dense_1169", 0, 0, {}]]], "config": {"name": "dense_1170", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 30, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_1171", "class_name": "Dense", "inbound_nodes": [[["dense_1170", 0, 0, {}]]], "config": {"name": "dense_1171", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 40, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_1172", "class_name": "Dense", "inbound_nodes": [[["dense_1171", 0, 0, {}]]], "config": {"name": "dense_1172", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true}}], "input_layers": [["input_147", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}