{"class_name": "Model", "config": {"name": "model_137", "output_layers": [["dense_1092", 0, 0]], "layers": [{"name": "input_137", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_137", "batch_input_shape": [null, 100], "sparse": false, "dtype": "float32"}}, {"name": "dense_1089", "class_name": "Dense", "inbound_nodes": [[["input_137", 0, 0, {}]]], "config": {"name": "dense_1089", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 90, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_1090", "class_name": "Dense", "inbound_nodes": [[["dense_1089", 0, 0, {}]]], "config": {"name": "dense_1090", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_1091", "class_name": "Dense", "inbound_nodes": [[["dense_1090", 0, 0, {}]]], "config": {"name": "dense_1091", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 40, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_1092", "class_name": "Dense", "inbound_nodes": [[["dense_1091", 0, 0, {}]]], "config": {"name": "dense_1092", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true}}], "input_layers": [["input_137", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}