{"keras_version": "2.0.6", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 400], "sparse": false, "name": "input_36", "dtype": "float32"}, "name": "input_36"}, {"inbound_nodes": [[["input_36", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_281", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 250, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "trainable": true, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 0.0}}}, "name": "dense_281"}, {"inbound_nodes": [[["dense_281", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_282", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 175, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "trainable": true, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 0.0}}}, "name": "dense_282"}, {"inbound_nodes": [[["dense_282", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_283", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 40, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "trainable": true, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 0.0}}}, "name": "dense_283"}, {"inbound_nodes": [[["dense_283", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_284", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "trainable": true, "activity_regularizer": null}, "name": "dense_284"}], "output_layers": [["dense_284", 0, 0]], "input_layers": [["input_36", 0, 0]], "name": "model_36"}, "backend": "tensorflow"}