{"keras_version": "2.0.6", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 400], "sparse": false, "name": "input_55", "dtype": "float32"}, "name": "input_55"}, {"inbound_nodes": [[["input_55", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_433", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 200, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "trainable": true, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 0.0}}}, "name": "dense_433"}, {"inbound_nodes": [[["dense_433", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_434", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 150, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "trainable": true, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 0.0}}}, "name": "dense_434"}, {"inbound_nodes": [[["dense_434", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_435", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 50, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "trainable": true, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 0.0}}}, "name": "dense_435"}, {"inbound_nodes": [[["dense_435", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_436", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "trainable": true, "activity_regularizer": null}, "name": "dense_436"}], "output_layers": [["dense_436", 0, 0]], "input_layers": [["input_55", 0, 0]], "name": "model_55"}, "backend": "tensorflow"}