{"keras_version": "2.0.6", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 400], "sparse": false, "name": "input_1", "dtype": "float32"}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 350, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "trainable": true, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 0.0}}}, "name": "dense_1"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 175, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "trainable": true, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 0.0}}}, "name": "dense_2"}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 80, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "trainable": true, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 0.0}}}, "name": "dense_3"}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_4", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "trainable": true, "activity_regularizer": null}, "name": "dense_4"}], "output_layers": [["dense_4", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}