{"keras_version": "2.0.6", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 400], "sparse": false, "name": "input_85", "dtype": "float32"}, "name": "input_85"}, {"inbound_nodes": [[["input_85", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_673", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 300, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "trainable": true, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 0.0}}}, "name": "dense_673"}, {"inbound_nodes": [[["dense_673", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_674", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 150, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "trainable": true, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 0.0}}}, "name": "dense_674"}, {"inbound_nodes": [[["dense_674", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_675", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 80, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "trainable": true, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 0.0}}}, "name": "dense_675"}, {"inbound_nodes": [[["dense_675", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_676", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "trainable": true, "activity_regularizer": null}, "name": "dense_676"}], "output_layers": [["dense_676", 0, 0]], "input_layers": [["input_85", 0, 0]], "name": "model_85"}, "backend": "tensorflow"}