{"class_name": "Model", "config": {"name": "model_125", "output_layers": [["dense_996", 0, 0]], "layers": [{"name": "input_125", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_125", "batch_input_shape": [null, 100], "sparse": false, "dtype": "float32"}}, {"name": "dense_993", "class_name": "Dense", "inbound_nodes": [[["input_125", 0, 0, {}]]], "config": {"name": "dense_993", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_994", "class_name": "Dense", "inbound_nodes": [[["dense_993", 0, 0, {}]]], "config": {"name": "dense_994", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 30, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_995", "class_name": "Dense", "inbound_nodes": [[["dense_994", 0, 0, {}]]], "config": {"name": "dense_995", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_996", "class_name": "Dense", "inbound_nodes": [[["dense_995", 0, 0, {}]]], "config": {"name": "dense_996", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true}}], "input_layers": [["input_125", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}