{"class_name": "Model", "config": {"name": "model_63", "output_layers": [["dense_500", 0, 0]], "layers": [{"name": "input_63", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_63", "batch_input_shape": [null, 100], "sparse": false, "dtype": "float32"}}, {"name": "dense_497", "class_name": "Dense", "inbound_nodes": [[["input_63", 0, 0, {}]]], "config": {"name": "dense_497", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 70, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_498", "class_name": "Dense", "inbound_nodes": [[["dense_497", 0, 0, {}]]], "config": {"name": "dense_498", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_499", "class_name": "Dense", "inbound_nodes": [[["dense_498", 0, 0, {}]]], "config": {"name": "dense_499", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 30, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_500", "class_name": "Dense", "inbound_nodes": [[["dense_499", 0, 0, {}]]], "config": {"name": "dense_500", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true}}], "input_layers": [["input_63", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}