{"class_name": "Model", "config": {"name": "model_87", "output_layers": [["dense_692", 0, 0]], "layers": [{"name": "input_87", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_87", "batch_input_shape": [null, 100], "sparse": false, "dtype": "float32"}}, {"name": "dense_689", "class_name": "Dense", "inbound_nodes": [[["input_87", 0, 0, {}]]], "config": {"name": "dense_689", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 60, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_690", "class_name": "Dense", "inbound_nodes": [[["dense_689", 0, 0, {}]]], "config": {"name": "dense_690", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_691", "class_name": "Dense", "inbound_nodes": [[["dense_690", 0, 0, {}]]], "config": {"name": "dense_691", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 40, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_692", "class_name": "Dense", "inbound_nodes": [[["dense_691", 0, 0, {}]]], "config": {"name": "dense_692", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true}}], "input_layers": [["input_87", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}