{"class_name": "Model", "config": {"name": "model_92", "output_layers": [["dense_732", 0, 0]], "layers": [{"name": "input_92", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_92", "batch_input_shape": [null, 100], "sparse": false, "dtype": "float32"}}, {"name": "dense_729", "class_name": "Dense", "inbound_nodes": [[["input_92", 0, 0, {}]]], "config": {"name": "dense_729", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 60, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_730", "class_name": "Dense", "inbound_nodes": [[["dense_729", 0, 0, {}]]], "config": {"name": "dense_730", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 40, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_731", "class_name": "Dense", "inbound_nodes": [[["dense_730", 0, 0, {}]]], "config": {"name": "dense_731", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 40, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_732", "class_name": "Dense", "inbound_nodes": [[["dense_731", 0, 0, {}]]], "config": {"name": "dense_732", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true}}], "input_layers": [["input_92", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}