{"class_name": "Model", "config": {"name": "model_168", "output_layers": [["dense_1340", 0, 0]], "layers": [{"name": "input_168", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_168", "batch_input_shape": [null, 100], "sparse": false, "dtype": "float32"}}, {"name": "dense_1337", "class_name": "Dense", "inbound_nodes": [[["input_168", 0, 0, {}]]], "config": {"name": "dense_1337", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 80, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_1338", "class_name": "Dense", "inbound_nodes": [[["dense_1337", 0, 0, {}]]], "config": {"name": "dense_1338", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 40, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_1339", "class_name": "Dense", "inbound_nodes": [[["dense_1338", 0, 0, {}]]], "config": {"name": "dense_1339", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 30, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true}}, {"name": "dense_1340", "class_name": "Dense", "inbound_nodes": [[["dense_1339", 0, 0, {}]]], "config": {"name": "dense_1340", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true}}], "input_layers": [["input_168", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}